Repository: common-repository/tatrapay-payment-gateway
Catalog: languages/tatrapay-payment-gateway-*.po
Languages: sk_sk

source: tatrapay+ Payment Gateway
sk_sk: tatrapay+ Platobná Brána

source: Latest payment processing solution from Tatrabanka. Accept Pay Later, credit/debit cards and bank accounts.
sk_sk: Najnovšie riešenie spracovania platieb od Tatrabanky. Prijímajte Pay Later, kreditné/debetné karty a bankové účty.

source: Client ID from developers portal https://developer.tatrabanka.sk/
sk_sk: Client ID z portálu pre vývojárov https://developer.tatrabanka.sk/

source: Client secret from developers portal https://developer.tatrabanka.sk/
sk_sk: Client secret z portálu pre vývojárov https://developer.tatrabanka.sk/

source: Enable debug logs
sk_sk: Zapnúť debug výpisy

source: Show response from gateway in order notes.
sk_sk: Zobraziť odpoveď z brány v poznámkach k objednávke.

source: Everything you need for accepting online payments
sk_sk: Všetko, čo potrebujete na prijímanie online platieb

source: Title
sk_sk: Názov

source: This controls the title which the user sees during checkout.
sk_sk: Tento názov sa zobrazí používateľovi počas platby.

source: Description
sk_sk: Popis

source: File upload failed
sk_sk: Nahrávanie súboru zlyhalo

source: Unable to connect with tatrapay+, please check your credentials.
sk_sk: Nie je možné sa pripojiť k tatrapay+, skontrolujte svoje prihlasovacie údaje.

source: Unable to set appearance logo.
sk_sk: Nie je možné nastaviť logo.

source: Unable to set appearance colors.
sk_sk: Nie je možné nastaviť farby vzhľadu.

source: Mode
sk_sk: Režim

source: Company logo
sk_sk: Logo spoločnosti

source: Shown in payment gateway
sk_sk: Zobrazené v platobnej bráne

source: Default theme
sk_sk: Predvolená téma

source: Button theme
sk_sk: Téma tlačidla

source: This controls the description which the user sees during checkout. Keep empty to use default description.
sk_sk: Toto riadi popis, ktorý používateľ vidí pri nákupe. Ak chcete použiť predvolený popis, ponechajte prázdne.

source: Pay securely through the tatrapay+ payment gateway with a payment card or bank transfer.
sk_sk: Plaťte bezpečne prostredníctvom platobnej brány tatrapay+ platobnou kartou alebo bankovým prevodom.

source: Pay securely using the tatrapay+ payment gateway with a payment card, bank transfer or the Na splátkyTB method.
sk_sk: Plaťte bezpečne pomocou platobnej brány tatrapay+ platobnou kartou, bankovým prevodom alebo metódou Na splátkyTB.

source: Payment gateway color theme.
sk_sk: Téma farieb platobnej brány.

source: This controls the color of PayLater button on product detail and catalog. Button is show for products with a price higher than €100 up to €30,000 (according to current conditions).
sk_sk: Týmto sa ovláda farba tlačidla 'Na splátkyTB' na detaile produktu v katalógu. Tlačidlo sa zobrazuje pri produktoch s cenou vyššou ako 100 € až do 30 000 € (podľa aktuálnych podmienok).

source: Color guide
sk_sk: Popis farieb

source: Payment button text color - dark mode
sk_sk: Farba textu tlačidla platby - tmavý režim

source: Payment button color - dark mode
sk_sk: Farba tlačidla platby - tmavý režim

source: Action text color - dark mode
sk_sk: Farba textu akcie - tmavý režim

source: Payment button text color - light mode
sk_sk: Farba textu tlačidla platby - svetlý režim

source: Payment button color - light mode
sk_sk: Farba tlačidla platby - svetlý režim

source: Action text color - light mode
sk_sk: Farba textu akcie - svetlý režim

source: Save user payment card during the payment.
sk_sk: Uožiť platobnú kartu používateľa počas nákupu.

source: To set up Comfortpay, it is necessary for the merchant to have concluded a contract on the operation of the Comfortpay service.
sk_sk: Pre nastavenie Comfortpay je potrebné, aby mal obchodník uzavretú zmluvu o prevádzkovaní služby Comfortpay.

source: Disabled
sk_sk: Vypnuté

source: Payment failed
sk_sk: Platba zlyhala

source: Please add this Redirect-URI to developers portal:
sk_sk: Pridajte túto Redirect-URI na portál pre vývojárov:
